review/EOS/Jackett_et_al_2006.org
#+TITLE: Jackett et al(2006) ノート
#+AUTHOR: KAWAI Yuta
#+LANGUAGE: ja
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./org.css" />

#+begin_abstract
 密度, 温位, 保存的な温度, 海水の凝結温度のアルゴリズムを示す. 
 温位, (温位を使った)密度のアルゴリズムは MJWF03 を更新したもの, 
 保存的な温度と凝結温度のアルゴリズムは新規である.
 塩分・圧力・保存的な温度を使った密度の計算手法は, 温位を使った密度の方程式と同程度の, 
 密度および対応する熱膨張率の誤差を生む. 
 Feistel の新しい状態方程式と比較するとき, これらはともに international EOS の
 二倍の精度を持つ. 
 温位を保存的な温度と関係付ける逆関数もまた示す. 
 実用塩分と絶対塩分の差を議論し, この差を本質的に無視する現在の方法は, 
 海洋モデルにおいて重大な誤差を引き起こさないことを示す.
#+end_abstract 

* イントロダクション
** McDougall et al(2003) (MJWF03) の状態方程式について
  - 動機
    - 海洋モデルは, 海洋の温度の変数として, (温度よりむしろ)温位を使ってきた. 
    - 有理式による密度の計算のための精度良い, 効率的なコードが不足していた. 
    - ギブスの熱力学ポテンシャルに基づく Feistel and Hagen(1995) の状態方程式
      - 海水の国際状態方程式(Fofonoff and Millard, 1983) より精度良く, またその弱点をいくつか解決
  - 内容
    - 海水の密度に 25 項の有理関数(圧力, 塩分, 温位の関数)をフィットさせた. 
    - Feistel and Hagen(1995) (FH95) の密度ルーチンと熱力学的な一貫性のある, 温位計算のための新しいアルゴリズムも提案した
  - 特徴 
    - 密度や温位の計算は, ギブスポテンシャルの級数表現に基づくルーチンよりも効率的
    - 海洋データとの比較によれば, 重要な海洋の変数に対する MJWF03 のアルゴリズムの精度は,  FH と同程度
    
** Feistel(2003) (F03) の状態方程式について
  - 内容
    - FH95 のギブスポテンシャルの更新
      - 新しいデータの制約とギブスポテンシャルの項数の追加
      
  - 特徴
    - 高圧における音速の改善
    - 密度最大となる温度の再現の精度向上
    - 係数の総数は 101 個に増加(FH95は83個). それによる計算コストは20%増 


** Jackett et al (2006) について
  - 目的
    - F03 のギブスポテンシャルの改良を, MJWF03 の状態方程式に反映させる. 
    - ポテンシャルエンタルピー, "保存的な温度"を使う状態方程式のアルゴリズムを提案
  - 内容
    - MJWF03 と同じ有理関数によるフィッティングを行う
