review/Jackett_et_al_2006.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>Jackett et al(2006) ノート</title>
<!-- 2013-11-26 火 19:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="KAWAI Yuta" />
</head>
<body>
<div id="content">
<h1 class="title">Jackett et al(2006) ノート</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">イントロダクション</a>
<ul>
<li><a href="#sec-1-1">McDougall et al(2003) (MJWF03) の状態方程式について</a></li>
<li><a href="#sec-1-2">Feistel(2003) (F03) の状態方程式について</a></li>
<li><a href="#sec-1-3">Jackett et al (2006) について</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="abstract">
<p>
密度, 温位, 保存的な温度, 海水の凝結温度のアルゴリズムを示す. 
温位, (温位を使った)密度のアルゴリズムは MJWF03 を更新したもの, 
保存的な温度と凝結温度のアルゴリズムは新規である.
塩分・圧力・保存的な温度を使った密度の計算手法は, 温位を使った密度の方程式と同程度の, 
密度および対応する熱膨張率の誤差を生む. 
Feistel の新しい状態方程式と比較するとき, これらはともに international EOS の
二倍の精度を持つ. 
温位を保存的な温度と関係付ける逆関数もまた示す. 
実用塩分と絶対塩分の差を議論し, この差を本質的に無視する現在の方法は, 
海洋モデルにおいて重大な誤差を引き起こさないことを示す.
</p>

</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> イントロダクション</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> McDougall et al(2003) (MJWF03) の状態方程式について</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>動機
<ul class="org-ul">
<li>海洋モデルは, 海洋の温度の変数として, (温度よりむしろ)温位を使ってきた. 
</li>
<li>有理式による密度の計算のための精度良い, 効率的なコードが不足していた. 
</li>
<li>ギブスの熱力学ポテンシャルに基づく Feistel and Hagen(1995) の状態方程式
<ul class="org-ul">
<li>海水の国際状態方程式(Fofonoff and Millard, 1983) より精度良く, またその弱点をいくつか解決
</li>
</ul>
</li>
</ul>
</li>
<li>内容
<ul class="org-ul">
<li>海水の密度に 25 項の有理関数(圧力, 塩分, 温位の関数)をフィットさせた. 
</li>
<li>Feistel and Hagen(1995) (FH95) の密度ルーチンと熱力学的な一貫性のある, 温位計算のための新しいアルゴリズムも提案した
</li>
</ul>
</li>
<li>特徴 
<ul class="org-ul">
<li>密度や温位の計算は, ギブスポテンシャルの級数表現に基づくルーチンよりも効率的
</li>
<li>海洋データとの比較によれば, 重要な海洋の変数に対する MJWF03 のアルゴリズムの精度は,  FH と同程度
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Feistel(2003) (F03) の状態方程式について</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>内容
<ul class="org-ul">
<li>FH95 のギブスポテンシャルの更新
<ul class="org-ul">
<li>新しいデータの制約とギブスポテンシャルの項数の追加
</li>
</ul>
</li>
</ul>
</li>

<li>特徴
<ul class="org-ul">
<li>高圧における音速の改善
</li>
<li>密度最大となる温度の再現の精度向上
</li>
<li>係数の総数は 101 個に増加(FH95は83個). それによる計算コストは20%増 
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Jackett et al (2006) について</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>目的
<ul class="org-ul">
<li>F03 のギブスポテンシャルの改良を, MJWF03 の状態方程式に反映させる. 
</li>
<li>ポテンシャルエンタルピー, "保存的な温度"を使う状態方程式のアルゴリズムを提案
</li>
</ul>
</li>
<li>内容
<ul class="org-ul">
<li>MJWF03 と同じ有理関数によるフィッティングを行う
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: KAWAI Yuta</p>
<p class="date">Created: 2013-11-26 火 19:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.3c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
